{
    "Home": {
      "Banner": {
        "title": { 
            "part1": "Hello, ",
            "part2": "My name is ",
            "part3": "Vandilson Brito ",
            "part4": "and I'm Front-end Web Developer."
         },
        "button": {
            "text": "Read more"
        }
      },
      "About": {
        "title": "About Me", 
        "description": {
            "part1": "I'm a front-end web developer with one year of experience, focusing on creating innovative, responsive, and user-friendly web applications.",
            "part2": "I hold a bachelor's degree in Interdisciplinary in Science and Technology from Universidade Federal da Bahia, where I began learning about algorithms, coding, and learning English.",
            "part3": "With my passion for world travel and English B2, I had the opportunity to participate in a cultural exchange in Europe in 2021. During this time, I volunteered, immersed myself in the local culture, and further developed my English skills. It was an enriching experience, especially at 22 years old and traveling alone. I learned a lot about people and the importance of respect and empathy."
        }
    },
    "Projects": {
      "title": "Projects",
      "buttons": {
        "buttonDemo": "See Demo",
        "buttonCode": "See Code"
      },
      "description": "* All projects were built by me. Freelancers and personal projects. ",
      "project1": {
        "description": "This application is an online flight booking search tool. It allows users to search for flights and book them (test mode). Once booked, users receive an email with the booking details. It was built using the Amadeus API (test mode), TypeScript, React.js (with react-query, react-hook-form, react-toastify, and react-slick), Tailwind CSS, Next.js, Zustand, and EmailJS. This project gave me the opportunity to practice TypeScript, Zustand, and TanStack Query (react-query) for the first time."
      },
      "project2": {
        "description": "The Delícias da Casa website functions as an online menu offering hamburgers and sandwiches, with a card payment option using Stripe. It was built with React (including Hooks, Router, Scroll, and Context API), Tailwind CSS, Stripe, Node.js, and Express. I learned about UX/UI design, created the designs in Figma, and had my first experience with state management using useContext. Challenges included integrating Stripe, which required back-end knowledge. For testing, use card number 4242 4242 4242 4242 with any expiration date and CVV."
      },
      "project3": {
        "description": "The website serves as a platform for the professor to gain public recognition and act as a content creator by publishing articles. It was built with React.js, Next.js, Tailwind CSS, Sanity CMS, Static Forms. I learned how to integrate Sanity CMS, allowing the professor to publish articles independently. Additionally, I gained experience in making a webpage visible on Google by handling domain purchase, DNS configuration, and implementing SEO best practices."
      },
      "project4": {
        "description": "The website is a place for mentor Professor Patrícia to showcase her work on academic projects mentorship and her YouTube channel. It was built with React (including Router, Scroll, and Helmet), Tailwind CSS, and Swiper JS. I practiced SEO using the react-helmet-async library, optimized image processing to reduce file size (webp), and made the website visible on Google by handling domain purchase, DNS configuration, and implementing SEO best practices."
      },
      "project5": {
        "description": "This is a newsletter subscription page, an interesting marketing alternative. It was built with React, Tailwind CSS, and MailChimp. It was fascinating to understand how newsletters work. MailChimp is a powerful platform for managing email campaigns, and I learned how to integrate it with React, extracting form data and sending to MailChimp."
      },
      "project6": {
        "description": "This application is a multi step form. The challenge was to learn Sass (a CSS pre-processor) and 'react-hook-form' lib, besides work with Context API. It was built with React (Hooks, Context API, react-hook-form) + Sass."
      },
      "project7": {
        "description": "This application is a dashboard with global COVID-19 data. It is possible to select a country on the map and see the number of cases, graphs showing the number of cases and deaths by date from the selected country. Built with Covid-19 API, TypeScript, Next.js, Leaflet, Apexcharts, Jotai."
      },
      "project8": {
        "description": "Recommendation site for the best books focusing on personal development and learning. Includes authentication, selection of favorite genres, ability to filter genres and favorite books. It has language switching functionality (PT and EN) using the i18n concept. Built with TypeScript, Next.js, Zustand, Firebase, Shadcn-ui and next-intl."
      }
      
    },
    "Skills": {
      "soft-skills": {
        "skill1": "English",
        "skill2": "Self-taught",
        "skill3": "Good communication",
        "skill4": "Team work",
        "skill5": "Emotional intelligence"
      }
    },
    "Contacts": {
      "title": "Contact"
    }
  }
}